<?php

namespace Database\Seeders;

use App\Enums\SystemPageEnum;
use App\Models\SystemPage;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class SystemPageSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $home = [
            'data' => [
                [
                    'title' => 'База правових позицій <LEX GO>',
                    'body' => 'Онлайн сервіс, який допоможе вам зрозуміти та оцінити важливість судових рішень',
                    'button_text' => 'Спробувати',
                    'button_link' => '#tariffs-section'
                ],
                [
                    'title' => 'Наша мета',
                    'items' => [
                        [
                            'icon' => '💼',
                            'title' => 'Порядок',
                            'body' => '<p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали серед тисяч (далі змінити на
                                текст наступного змісту: "юридичних ресурсів (фейсбук, телеграм, ЄДРСР, тощо)?</p><p>Коли ви (далі змінити на текст наступного змісту: "зберегли цікавий висновок ККС, і не
                                можете знайти його серед тисяч скріншотів, постів/ репостів на стіні у ФБ тощо?"</p><p>Ми розробили..... до Ваших послуг. Доповнити: "Відтепер все в одному місці та завжи
                                поруч"</p>'
                        ],
                        [
                            'icon' => '⏱️',
                            'title' => 'Швидкість = час!',
                            'body' => '<p>Даний ресурс робить процес пошуку відповіді на юридичне питання простим, зручним,
                                швидким.</p><p>Структура бази, викладки сторінки із судовим рішенням, надані інструменти допоможуть
                                досягнути цієї мети та зекономити час.</p>'
                        ],
                        [
                            'icon' => '😉',
                            'title' => 'Зручність',
                            'body' => '<p>Даний продукт виконано у двох формах: веб сайту та мобільних додатків на базі android та iOS, що дозволяє зручно користуватися ним у будь-який час.</p>'
                        ],
                        [
                            'icon' => '🏠',
                            'title' => 'Надійність',
                            'body' => '<p>Зручне, надійне місце зберігання персональної бібліотеки. Відтепер, Ви позбудетесь
                                побоювань втратити все з ризиком неможливості відновлення втрачених багаторічних
                                напрацювань.</p><p>Все надійно зберігається в одному місці і завжди під рукою.</p>'
                        ],
                    ]
                ],
                [
                    'title' => 'Чому саме цей ресурс?',
                    'items' => [
                        'Структура бази, подібна до структури кк, кпк',
                        'Викладка судових рішень за постатейною логікою зберігання та темами у кінцевому каталогу',
                        'Iнтелектуальна система пошуку',
                        'Особистий кабінет із корисними функціями та персональним налаштуванням під корисувача для створення власної бібліотеки',
                        'Проста та зрозуміла структура сторінки із судовим рішенням: назва, реквізити рішення, правовий висновок, судове рішення. Вже по назві рішення з 3-7 слів зрозумілий правовий висновок загалом',
                        'Додатково опрацьовано візуалізацію на кожному етапі роботи з базою. Якщо вина на етапі дослідження змісту каталогів, обираєте необхідний розділ/главу/статтю з використанням чекбоксу – навігаційна панель переважає у розмірі над вікном візуалізації збірок правових позицій. А коли Ви працюєте над дослідженням викладених правових позицій, можна розвернути вікно викладки для кращого візуального сприйняття',
                        'Можливість використання мобільного додатку або веб версії'
                    ]
                ],
                [
                    'title' => 'Є рішення',
                    'items' => [
                        [
                            'img' => '/assets/img/decision-img.webp',
                            'title' => 'Нарешті всі ваші рахунки в одному місці, завдяки прямим інтеграціям',
                            'quote' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?',
                            'body' => '<p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?</p>'
                        ],
                        [
                            'img' => '/assets/img/decision-img.webp',
                            'title' => 'Нарешті всі ваші рахунки в одному місці, завдяки прямим інтеграціям',
                            'quote' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?',
                            'body' => '<p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?</p>'
                        ],
                        [
                            'img' => '/assets/img/decision-img.webp',
                            'title' => 'Нарешті всі ваші рахунки в одному місці, завдяки прямим інтеграціям',
                            'quote' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?',
                            'body' => '<p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?</p>'
                        ],
                        [
                            'img' => '/assets/img/decision-img.webp',
                            'title' => 'Нарешті всі ваші рахунки в одному місці, завдяки прямим інтеграціям',
                            'quote' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?',
                            'body' => '<p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?</p>'
                        ],
                        [
                            'img' => '/assets/img/decision-img.webp',
                            'title' => 'Нарешті всі ваші рахунки в одному місці, завдяки прямим інтеграціям',
                            'quote' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?',
                            'body' => '<p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?</p>'
                        ],
                        [
                            'img' => '/assets/img/decision-img.webp',
                            'title' => 'Нарешті всі ваші рахунки в одному місці, завдяки прямим інтеграціям',
                            'quote' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?',
                            'body' => '<p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?</p>'
                        ],
                        [
                            'img' => '/assets/img/decision-img.webp',
                            'title' => 'Нарешті всі ваші рахунки в одному місці, завдяки прямим інтеграціям',
                            'quote' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?',
                            'body' => '<p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?</p>'
                        ],
                        [
                            'img' => '/assets/img/decision-img.webp',
                            'title' => 'Нарешті всі ваші рахунки в одному місці, завдяки прямим інтеграціям',
                            'quote' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?',
                            'body' => '<p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?</p>'
                        ],
                    ]
                ],
                [
                    'title' => 'Спробуйте наш сервіс всього <за 5 $> / місяць',
                    'body' => 'Ви заощаджуєте час та зусилля, отримуючи миттєвий доступ до багатої бази статей, які допоможуть вам успішно розумітися на складних юридичних питаннях.',
                    'button_text' => 'Спробувати',
                    'button_link' => '#tariffs-section'
                ],
                [
                    'title' => 'Про наш сервіс',
                    'body' => '<p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних
                    ресурсів?</p><p>Клінінг – модне слово чи якісно новий рівень чистоти? Все залежить від фахівців, яким Ви довірите
                    наведення порядку.</p><p>Клінінгова компанія CLEANHOUSE (КЛІНХАУС) пропонує широкий спектр послуг з якісного прибирання
                    житлових, офісних та складських приміщень, а також магазинів та торгових площ.</p><p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних
                    ресурсів?</p><p>Клінінг – модне слово чи якісно новий рівень чистоти? Все залежить від фахівців, яким Ви довірите
                    наведення порядку.</p><p>Клінінгова компанія CLEANHOUSE (КЛІНХАУС) пропонує широкий спектр послуг з якісного прибирання
                    житлових, офісних та складських приміщень, а також магазинів та торгових площ.</p><p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних
                    ресурсів?</p><p>Клінінг – модне слово чи якісно новий рівень чистоти? Все залежить від фахівців, яким Ви довірите
                    наведення порядку.</p><p>Клінінгова компанія CLEANHOUSE (КЛІНХАУС) пропонує широкий спектр послуг з якісного прибирання
                    житлових, офісних та складських приміщень, а також магазинів та торгових площ.</p>'
                ]
            ],
            'images' => [
                '/assets/img/top-img.webp',
                '/assets/img/try-img.webp'
            ]
        ];
        $dashboard = [
            'images' => [
                '/assets/img/user/welcome-img.svg',
            ],
            'data' => [
                [
                    'title' => 'Ми зібрали для Вас безліч правових позицій на всі актуальні питання',
                    'button_text' => 'Перейти у збірник',
                    'button_link' => '/articles',
                ]
            ]
        ];

        SystemPage::truncate();
        SystemPage::create([
            'name' => SystemPageEnum::HOME->value,
            'title' => 'Домашня',
            'data' => $home['data'],
            'images' => $home['images'],
        ]);
        SystemPage::create([
            'name' => SystemPageEnum::DASHBOARD->value,
            'title' => 'Вітання',
            'data' => $dashboard['data'],
            'images' => $dashboard['images'],
        ]);
    }
}
