<?php

namespace Database\Seeders;

use App\Enums\SystemPageEnum;
use App\Models\SystemPage;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class SystemPageSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        if (!SystemPage::whereName(SystemPageEnum::HOME->value)->exists()) {
            SystemPage::create([
                'name' => SystemPageEnum::HOME->value,
                'title' => 'Домашня',
                'data' => [
                    [
                        'title' => 'База правових позицій <LEX GO>',
                        'body' => 'Онлайн сервіс, який допоможе вам зрозуміти та оцінити важливість судових рішень',
                        'button_text' => 'Спробувати',
                        'button_link' => '#tariffs-section'
                    ],
                    [
                        'title' => 'Наша мета',
                        'items' => [
                            [
                                'icon' => '💼',
                                'title' => 'Порядок',
                                'body' => '<p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали серед тисяч (далі змінити на
                                текст наступного змісту: "юридичних ресурсів (фейсбук, телеграм, ЄДРСР, тощо)?</p><p>Коли ви (далі змінити на текст наступного змісту: "зберегли цікавий висновок ККС, і не
                                можете знайти його серед тисяч скріншотів, постів/ репостів на стіні у ФБ тощо?"</p><p>Ми розробили..... до Ваших послуг. Доповнити: "Відтепер все в одному місці та завжи
                                поруч"</p>'
                            ],
                            [
                                'icon' => '⏱️',
                                'title' => 'Швидкість = час!',
                                'body' => '<p>Даний ресурс робить процес пошуку відповіді на юридичне питання простим, зручним,
                                швидким.</p><p>Структура бази, викладки сторінки із судовим рішенням, надані інструменти допоможуть
                                досягнути цієї мети та зекономити час.</p>'
                            ],
                            [
                                'icon' => '😉',
                                'title' => 'Зручність',
                                'body' => '<p>Даний продукт виконано у двох формах: веб сайту та мобільних додатків на базі android та iOS, що дозволяє зручно користуватися ним у будь-який час.</p>'
                            ],
                            [
                                'icon' => '🏠',
                                'title' => 'Надійність',
                                'body' => '<p>Зручне, надійне місце зберігання персональної бібліотеки. Відтепер, Ви позбудетесь
                                побоювань втратити все з ризиком неможливості відновлення втрачених багаторічних
                                напрацювань.</p><p>Все надійно зберігається в одному місці і завжди під рукою.</p>'
                            ],
                        ]
                    ],
                    [
                        'title' => 'Чому саме цей ресурс?',
                        'items' => [
                            'Структура бази, подібна до структури кк, кпк',
                            'Викладка судових рішень за постатейною логікою зберігання та темами у кінцевому каталогу',
                            'Iнтелектуальна система пошуку',
                            'Особистий кабінет із корисними функціями та персональним налаштуванням під корисувача для створення власної бібліотеки',
                            'Проста та зрозуміла структура сторінки із судовим рішенням: назва, реквізити рішення, правовий висновок, судове рішення. Вже по назві рішення з 3-7 слів зрозумілий правовий висновок загалом',
                            'Додатково опрацьовано візуалізацію на кожному етапі роботи з базою. Якщо вина на етапі дослідження змісту каталогів, обираєте необхідний розділ/главу/статтю з використанням чекбоксу – навігаційна панель переважає у розмірі над вікном візуалізації збірок правових позицій. А коли Ви працюєте над дослідженням викладених правових позицій, можна розвернути вікно викладки для кращого візуального сприйняття',
                            'Можливість використання мобільного додатку або веб версії'
                        ]
                    ],
                    [
                        'title' => 'Є рішення',
                        'items' => [
                            [
                                'img' => '/assets/img/decision-img.webp',
                                'title' => 'Нарешті всі ваші рахунки в одному місці, завдяки прямим інтеграціям',
                                'quote' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?',
                                'body' => '<p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?</p>'
                            ],
                            [
                                'img' => '/assets/img/decision-img.webp',
                                'title' => 'Нарешті всі ваші рахунки в одному місці, завдяки прямим інтеграціям',
                                'quote' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?',
                                'body' => '<p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?</p>'
                            ],
                            [
                                'img' => '/assets/img/decision-img.webp',
                                'title' => 'Нарешті всі ваші рахунки в одному місці, завдяки прямим інтеграціям',
                                'quote' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?',
                                'body' => '<p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?</p>'
                            ],
                            [
                                'img' => '/assets/img/decision-img.webp',
                                'title' => 'Нарешті всі ваші рахунки в одному місці, завдяки прямим інтеграціям',
                                'quote' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?',
                                'body' => '<p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?</p>'
                            ],
                            [
                                'img' => '/assets/img/decision-img.webp',
                                'title' => 'Нарешті всі ваші рахунки в одному місці, завдяки прямим інтеграціям',
                                'quote' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?',
                                'body' => '<p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?</p>'
                            ],
                            [
                                'img' => '/assets/img/decision-img.webp',
                                'title' => 'Нарешті всі ваші рахунки в одному місці, завдяки прямим інтеграціям',
                                'quote' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?',
                                'body' => '<p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?</p>'
                            ],
                            [
                                'img' => '/assets/img/decision-img.webp',
                                'title' => 'Нарешті всі ваші рахунки в одному місці, завдяки прямим інтеграціям',
                                'quote' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?',
                                'body' => '<p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?</p>'
                            ],
                            [
                                'img' => '/assets/img/decision-img.webp',
                                'title' => 'Нарешті всі ваші рахунки в одному місці, завдяки прямим інтеграціям',
                                'quote' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?',
                                'body' => '<p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів?</p>'
                            ],
                        ]
                    ],
                    [
                        'title' => 'Спробуйте наш сервіс всього <за 5 $> / місяць',
                        'body' => 'Ви заощаджуєте час та зусилля, отримуючи миттєвий доступ до багатої бази статей, які допоможуть вам успішно розумітися на складних юридичних питаннях.',
                        'button_text' => 'Спробувати',
                        'button_link' => '#tariffs-section'
                    ],
                    [
                        'title' => 'Про наш сервіс',
                        'body' => '<p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних
                    ресурсів?</p><p>Клінінг – модне слово чи якісно новий рівень чистоти? Все залежить від фахівців, яким Ви довірите
                    наведення порядку.</p><p>Клінінгова компанія CLEANHOUSE (КЛІНХАУС) пропонує широкий спектр послуг з якісного прибирання
                    житлових, офісних та складських приміщень, а також магазинів та торгових площ.</p><p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних
                    ресурсів?</p><p>Клінінг – модне слово чи якісно новий рівень чистоти? Все залежить від фахівців, яким Ви довірите
                    наведення порядку.</p><p>Клінінгова компанія CLEANHOUSE (КЛІНХАУС) пропонує широкий спектр послуг з якісного прибирання
                    житлових, офісних та складських приміщень, а також магазинів та торгових площ.</p><p>Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних
                    ресурсів?</p><p>Клінінг – модне слово чи якісно новий рівень чистоти? Все залежить від фахівців, яким Ви довірите
                    наведення порядку.</p><p>Клінінгова компанія CLEANHOUSE (КЛІНХАУС) пропонує широкий спектр послуг з якісного прибирання
                    житлових, офісних та складських приміщень, а також магазинів та торгових площ.</p>'
                    ]
                ],
                'images' => [
                    '/assets/img/top-img.webp',
                    '/assets/img/try-img.webp'
                ]
            ]);
        }

        if (!SystemPage::whereName(SystemPageEnum::DASHBOARD->value)->exists()) {
            SystemPage::create([
                'name' => SystemPageEnum::DASHBOARD->value,
                'title' => 'Вітання',
                'data' => [
                    [
                        'title' => 'Ми зібрали для Вас безліч правових позицій на всі актуальні питання',
                        'button_text' => 'Перейти у збірник',
                        'button_link' => '/articles',
                    ]
                ],
                'images' => [
                    '/assets/img/user/welcome-img.svg',
                ],
            ]);
        }

        if (!SystemPage::whereName(SystemPageEnum::FAQ->value)->exists()) {
            SystemPage::create([
                'name' => SystemPageEnum::FAQ->value,
                'title' => 'FAQ',
                'data' => [
                    [
                        'title' => 'Назва категорії',
                        'items' => [
                            [
                                'title' => 'Як це працює?',
                                'body' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів'
                            ],
                            [
                                'title' => 'Як користуватись сервісом?',
                                'body' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів'
                            ],
                            [
                                'title' => 'Як користуватись сервісом?',
                                'body' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів'
                            ],
                            [
                                'title' => 'Як користуватись сервісом?',
                                'body' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів'
                            ],
                            [
                                'title' => 'Як користуватись сервісом?',
                                'body' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів'
                            ],
                        ]
                    ],
                    [
                        'title' => 'Назва категорії',
                        'items' => [
                            [
                                'title' => 'Як це працює?',
                                'body' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів'
                            ],
                            [
                                'title' => 'Як користуватись сервісом?',
                                'body' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів'
                            ],
                            [
                                'title' => 'Як користуватись сервісом?',
                                'body' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів'
                            ],
                            [
                                'title' => 'Як користуватись сервісом?',
                                'body' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів'
                            ],
                            [
                                'title' => 'Як користуватись сервісом?',
                                'body' => 'Вам знайома ситуація, коли Ви шукаєте те, що колись читали, серед тисяч скріншотів різних юридичних ресурсів'
                            ],
                        ]
                    ],
                ],
                'images' => [],
            ]);
        }

        if (!SystemPage::whereName(SystemPageEnum::ARTICLES->value)->exists()) {
            SystemPage::create([
                'name' => SystemPageEnum::ARTICLES->value,
                'title' => 'Збірник',
                'data' => [],
                'images' => [],
                'meta' => [],
            ]);
        }

        if (!SystemPage::whereName(SystemPageEnum::BLOG->value)->exists()) {
            SystemPage::create([
                'name' => SystemPageEnum::BLOG->value,
                'title' => 'Блог',
                'data' => [],
                'images' => [],
                'meta' => [],
            ]);
        }

        if (!SystemPage::whereName(SystemPageEnum::CONTACTS->value)->exists()) {
            SystemPage::create([
                'name' => SystemPageEnum::CONTACTS->value,
                'title' => 'Контакти',
                'data' => [],
                'images' => [],
                'meta' => [],
            ]);
        }

        if (!SystemPage::whereName(SystemPageEnum::POLICY->value)->exists()) {
            SystemPage::create([
                'name' => SystemPageEnum::POLICY->value,
                'title' => 'Політика конфідеційності',
                'data' => [
                    [
                        'body' => '<h1>Політика конфідеційності</h1><p><strong>1. Збір інформації</strong><br>Ми можемо збирати особисту інформацію, яку ви нам надаєте, таку як ім\'я, електронна адреса, номер телефону, або інша інформація, коли ви використовуєте наш сервіс...</p><p><strong>2. Використання інформації</strong><br>Ми використовуємо зібрану інформацію для надання, підтримки, покращення та розвитку наших послуг...</p><p><strong>3. Розкриття інформації</strong><br>Ми можемо розкривати вашу особисту інформацію третім сторонам лише за вашою згодою або відповідно до законодавства..</p><p><strong>4. Захист інформації</strong><br>Ми вживаємо заходів для захисту вашої особистої інформації від несанкціонованого доступу, використання або розкриття...</p>'
                    ]
                ],
                'images' => [],
                'meta' => [],
            ]);
        }

        if (!SystemPage::whereName(SystemPageEnum::OFFER->value)->exists()) {
            SystemPage::create([
                'name' => SystemPageEnum::OFFER->value,
                'title' => 'Публічна Оферта',
                'data' => [
                    [
                        'body' => '<h1>Публічна Оферта</h1><p>Ця Публічна Оферта (далі - "Оферта") є публічним пропозиційним документом від Збірник, що регулює умови надання послуг та використання сайту<a href="http://urist.loc">Збірник</a>.</p><h1>1. Визначення термінів</h1><p>1.1. <span class="terms">Сайт</span> - інтернет-ресурс <a href="http://urist.loc">Збірник</a>, який надає користувачам доступ до певних послуг.</p><p>1.2. <span class="terms">Користувач</span> - фізична або юридична особа, яка користується послугами сайту.</p><h1>2. Предмет Оферти</h1><p>2.1. Сайт надає користувачам можливість скористатися рядом послуг, що надаються на умовах, визначених цією Офертою.</p><p>2.2. Користувач погоджується з умовами цієї Оферти при використанні будь-яких послуг, доступних на сайті.</p><h1>3. Умови надання послуг</h1><p>3.1. Користувач зобов\'язується не порушувати законодавство при використанні сайту та не допускати дій, що можуть призвести до шкоди функціонуванню сайту.</p><p>3.2. Адміністрація сайту залишає за собою право змінювати умови надання послуг без попереднього повідомлення.</p>'
                    ]
                ],
                'images' => [],
                'meta' => [],
            ]);
        }

        if (!SystemPage::whereName(SystemPageEnum::USER_PROFILE->value)->exists()) {
            SystemPage::create([
                'name' => SystemPageEnum::USER_PROFILE->value,
                'title' => 'Мій профіль',
                'data' => [],
                'images' => [],
                'meta' => [],
            ]);
        }

        if (!SystemPage::whereName(SystemPageEnum::USER_CABINET->value)->exists()) {
            SystemPage::create([
                'name' => SystemPageEnum::USER_CABINET->value,
                'title' => 'Кабінет',
                'data' => [],
                'images' => [],
                'meta' => [],
            ]);
        }

        if (!SystemPage::whereName(SystemPageEnum::USER_REGISTRIES->value)->exists()) {
            SystemPage::create([
                'name' => SystemPageEnum::USER_REGISTRIES->value,
                'title' => 'Реєстр',
                'data' => [],
                'images' => [],
                'meta' => [],
            ]);
        }

        if (!SystemPage::whereName(SystemPageEnum::USER_SUBSCRIPTION->value)->exists()) {
            SystemPage::create([
                'name' => SystemPageEnum::USER_SUBSCRIPTION->value,
                'title' => 'Моя підписка',
                'data' => [
                    [
                        'body' => 'Ви можете обрати кращий тариф який надасть вам можливість використання нашого сервісу по максимуму.',
                    ],
                ],
                'images' => [],
                'meta' => [],
            ]);
        }

    }
}
