@extends('layouts.user_app')
@section('title', 'Редагування файлу')
@section('page')
    <section class="page-section">
        <div class="container page-section__container">
            <header class="page-section__header">
                <div class="page-section__descr">
                    <button class="button button--outline page-section__back-button" type="button" aria-label="Back" data-tooltip="Назад">
                        <svg class="button__icon" width="10" height="19">
                            <use xlink:href="{{asset('assets/img/user/sprite.svg#arrow-left')}}"></use>
                        </svg>
                    </button>
                    <div class="page-section__info">
                        <h1 class="page-title page-section__title">Ст. 1 глава 1 Кримінальне процесуальне законодавство</h1><a class="blue-link page-section__link" href="#">Посилання на рішення </a>
                    </div>
                </div>
                <ul class="actions page-section__actions">
                    <li class="actions__item">
                        <button class="button button--outline actions__button" type="button" aria-label="Add to bookmarks" data-tooltip="В закладки" data-modal="modal-bookmark">
                            <svg class="button__icon" width="19" height="24">
                                <use xlink:href="{{asset('assets/img/user/sprite.svg#bookmark')}}"></use>
                            </svg>
                        </button>
                    </li>
                    <li class="actions__item">
                        <button class="button button--outline actions__button" type="button" aria-label="Add page" data-tooltip="Робота з файлом" data-modal="modal-file">
                            <svg class="button__icon" width="22" height="24">
                                <use xlink:href="{{asset('assets/img/user/sprite.svg#create')}}"></use>
                            </svg>
                        </button>
                    </li>
                    <li class="actions__item">
                        <button class="button button--outline actions__button" type="button" aria-label="Copy" data-tooltip="Копіювати">
                            <svg class="button__icon" width="22" height="22">
                                <use xlink:href="{{asset('assets/img/user/sprite.svg#copy')}}"></use>
                            </svg>
                        </button>
                    </li>
                </ul>
            </header>
            <div class="page-section__text">
                <p><strong class="blue-color">Кримінальне процесуальне законодавство України складається з відповідних положень Конституції України, міжнародних договорів, згода на обов’язковість яких надана Верховною Радою України, цього Кодексу та інших законів України.</strong></p>
                <p><strong class="blue-color">Зміни до кримінального процесуального законодавства України можуть вноситися виключно законами про внесення змін до цього Кодексу та/або до законодавства про кримінальну відповідальність, та/або до законодавства України про адміністративні правопорушення.</strong></p>
                <p>1. Порядок кримінального провадження на території України визначається лише кримінальним процесуальним законодавством України.</p>
                <p>2. Кримінальне процесуальне законодавство України складається з відповідних положень Конституції України, міжнародних договорів, згода на обов’язковість яких надана Верховною Радою України, цього Кодексу та інших законів України.</p>
                <p>3. Зміни до кримінального процесуального законодавства України можуть вноситися виключно законами про внесення змін до цього Кодексу та/або до законодавства про кримінальну відповідальність, та/або до законодавства України про адміністративні правопорушення.</p>
                <p>1. Порядок кримінального провадження на території України визначається лише кримінальним процесуальним законодавством України.</p>
                <p>2. Кримінальне процесуальне законодавство України складається з відповідних положень Конституції України, міжнародних договорів, згода на обов’язковість яких надана Верховною Радою України, цього Кодексу та інших законів України.</p>
                <p>3. Зміни до кримінального процесуального законодавства України можуть вноситися виключно законами про внесення змін до цього Кодексу та/або до законодавства про кримінальну відповідальність, та/або до законодавства України про адміністративні правопорушення.</p>
                <p>1. Порядок кримінального провадження на території України визначається лише кримінальним процесуальним законодавством України.</p>
                <p>2. Кримінальне процесуальне законодавство України складається з відповідних положень Конституції України, міжнародних договорів, згода на обов’язковість яких надана Верховною Радою України, цього Кодексу та інших законів України.</p>
                <p>3. Зміни до кримінального процесуального законодавства України можуть вноситися виключно законами про внесення змін до цього Кодексу та/або до законодавства про кримінальну відповідальність, та/або до законодавства України про адміністративні правопорушення.</p>
                <p>1. Порядок кримінального провадження на території України визначається лише кримінальним процесуальним законодавством України.</p>
                <p>2. Кримінальне процесуальне законодавство України складається з відповідних положень Конституції України, міжнародних договорів, згода на обов’язковість яких надана Верховною Радою України, цього Кодексу та інших законів України.</p>
                <p>3. Зміни до кримінального процесуального законодавства України можуть вноситися виключно законами про внесення змін до цього Кодексу та/або до законодавства про кримінальну відповідальність, та/або до законодавства України про адміністративні правопорушення.</p>
            </div>
        </div>
    </section>
@endsection
